In [4]:
import pandas as pd # pandas is a data manipulation library
import numpy as np #provides numerical arrays and functions to manipulate the arrays efficiently
import random
import matplotlib.pyplot as plt # data visualization library
import operator
#from wordcloud import WordCloud, STOPWORDS #used to generate world cloud

In [6]:
# lets explore movies.csv
m_cols = ['movie_id','movie title','release date','video release date','IMDb URL'
          ,'unknown','Action','Adventure','Animation','Childrens','Comedy',
          'Crime','Documentary','Drama','Fantasy','Film-Noir','Horror','Musical','Mystery','Romance','Sci-Fi',
        'Thriller','War','Western']
data= pd.read_csv('ml-100k/u.item',delimiter='|',names=m_cols,encoding='latin-1')
#data.shape

In [7]:
data.head()

,movie_id,movie title,release date,video release date,IMDb URL,unknown,Action,Adventure,Animation,Childrens,...,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,...,0,0,0,0,0,0,0,0,0,0
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,...,0,0,0,0,0,0,0,1,0,0
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995),0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [8]:
#data.info()

In [9]:
#number of unique movies
movies = data['movie_id'].unique().tolist()
num_items = len(movies)

In [10]:
#explore users
u_cols = ['user_id','age','gender','occupation','zip_code']
data_u = pd.read_csv('ml-100k/u.user',delimiter='|',names=u_cols,encoding='latin-1')
#data_u.shape

In [11]:
#data_u.head()

In [12]:
#number of unique users
users = data_u['user_id'].unique().tolist()
num_users = len(users)
#num_users

In [17]:
#explore ratings
r_cols = ['user_id','movie_id','rating','timestamp']
data_r = pd.read_csv('ml-100k/u1.base',delimiter='\t',names=r_cols,encoding='latin-1')
#data_r.shape

movies_r = data.merge(data_r,on = 'movie_id',how = 'inner')

In [18]:
data_r.head()

   user_id  movie_id  rating  timestamp
0        1         1       5  874965758
1        1         2       3  876893171
2        1         3       4  878542960
3        1         4       3  876893119
4        1         5       3  889751712

In [19]:
movies_r.head(5)

,movie_id,movie title,release date,video release date,IMDb URL,unknown,Action,Adventure,Animation,Childrens,...,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western,user_id,rating,timestamp
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,...,0,0,0,0,0,0,0,1,5,874965758
1,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,...,0,0,0,0,0,0,0,2,4,888550871
2,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,...,0,0,0,0,0,0,0,6,4,883599478
3,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,...,0,0,0,0,0,0,0,13,3,882140487
4,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,...,0,0,0,0,0,0,0,16,5,877717833

# Q2, a

In [21]:
ratings = movies_r[['movie_id','movie title','rating']].groupby(['movie_id','movie title']).mean()
ratings = ratings.sort_values(['rating'],ascending=False)
ratings.head(3)

                                                            rating
movie_id movie title
1189     Prefontaine (1997)                                    5.0
1653     Entertaining Angels: The Dorothy Day Story (1996)     5.0
1599     Someone Else's America (1995)                         5.0

# Q2, b

In [40]:
count_rating = movies_r[['movie_id','movie title','rating']].groupby(['movie_id','movie title']).count()
count_rating = count_rating.sort_values(['rating'],ascending=False)
count_rating.head()

                                    rating
movie_id movie title
50       Star Wars (1977)              484
181      Return of the Jedi (1983)     422
258      Contact (1997)                402

# Q2, c

In [72]:
count_rating = movies_r[['movie_id','movie title','rating']].groupby(['movie_id','movie title']).count()
count_rating = count_rating.reset_index()

count_rating_big_than_4 = movies_r[['movie_id','movie title','rating']][movies_r.rating > 4].groupby(['movie_id','movie title']).count()
count_rating_big_than_4 = count_rating_big_than_4.reset_index()

movies  = pd.DataFrame(columns = ['movie_id','movie title','rating_percent'])

for index, row in count_rating_big_than_4.iterrows():
    total_rating = count_rating.loc[count_rating['movie_id'] == row.movie_id].rating.values[0]
    rating_percent = (float(row.rating) / total_rating) * 100
    movies.loc[index] = [row['movie_id'], row['movie title'],  rating_percent]

movies = movies.sort_values(['rating_percent'],ascending=False)
movies.head(3)

,movie_id,movie title,rating_percent
1034,1293,Star Kid (1997),100.0
1113,1653,Entertaining Angels: The Dorothy Day Story (1996),100.0
986,1189,Prefontaine (1997),100.0

# Q2, d

In [83]:
count_rating = count_rating.sort_values(['rating'],ascending=False)
max_count_rating = count_rating.head(1).rating

# ratings = ratings.reset_index()
# count_rating = count_rating.reset_index()


new_rating_movies  = pd.DataFrame(columns = ['movie_id','movie title','new rating'])
pi = 3.14159265
for index, row in count_rating.iterrows():
    add_rating =  float((row.rating / max_count_rating))
    new_rating =  ratings.loc[ratings['movie_id'] == row.movie_id].rating.values[0] + add_rating - 1
    new_rating_movies.loc[index] = [row['movie_id'], row['movie title'], new_rating]

new_rating_movies = new_rating_movies.sort_values(['new rating'],ascending=False)
new_rating_movies.head(3)

     movie_id                                 movie title  new rating
49         50                            Star Wars (1977)    4.359504
1284     1293                             Star Kid (1997)    4.006198
1449     1467        Saint of Fort Washington, The (1993)    4.004132
1181     1189                          Prefontaine (1997)    4.004132
1193     1201  Marlene Dietrich: Shadow and Light (1996)     4.002066

# Q2, e

# Womens:

In [85]:
#merge movies ratings data with users
movie_ratings_data_and_users = movies_ratings_data.merge(data_u,on = 'user_id',how = 'inner')
woman_ratings = movie_ratings_data_and_users[['movie_id','movie title','rating']][movie_ratings_data_and_users.gender == 'F']
woman_ratings.head()

     movie_id           movie title  rating
135         1      Toy Story (1995)       4
136        10    Richard III (1995)       2
137        14    Postino, Il (1994)       4
138        25  Birdcage, The (1996)       4
139       100          Fargo (1996)       5

In [119]:
#Q2, e (a)

mean_ratings_women = woman_ratings[['movie_id','movie title','rating']].groupby(['movie_id','movie title']).mean()
mean_ratings_women = mean_ratings_women.sort_values(['rating'],ascending=False)
mean_ratings_women.head(3)

                              rating
movie_id movie title
1        Toy Story (1995)   3.800000
2        GoldenEye (1995)   3.200000
3        Four Rooms (1995)  2.538462

In [88]:
#Q2, e (b)

count_rating_womens = woman_ratings[['movie_id','movie title','rating']].groupby(['movie_id','movie title']).count()
count_rating_womens = count_rating_womens.sort_values(['rating'],ascending=False)
count_rating_womens.head(3)

                                      rating
movie_id movie title
50       Star Wars (1977)                125
286      English Patient, The (1996)     125
288      Scream (1996)                   118

In [90]:
#Q2, e (c)

count_rating_womens = woman_ratings[['movie_id','movie title','rating']].groupby(['movie_id','movie title']).count()
count_rating_womens = count_rating_womens.reset_index()

count_rating_big_than_4 = woman_ratings[['movie_id','movie title','rating']][woman_ratings.rating > 4].groupby(['movie_id','movie title']).count()
count_rating_big_than_4 = count_rating_big_than_4.reset_index()

movies  = pd.DataFrame(columns = ['movie_id','movie title','rating_percent'])

for index, row in count_rating_big_than_4.iterrows():
    total_rating = count_rating.loc[count_rating['movie_id'] == row.movie_id].rating.values[0]
    rating_percent = (float(row.rating) / total_rating) * 100
    movies.loc[index] = [row['movie_id'], row['movie title'],  rating_percent]

movies = movies.sort_values(['rating_percent'],ascending=False)
movies.head(3)

    movie_id                            movie title  rating_percent
846     1599          Someone Else's America (1995)           100.0
839     1472  Visitors, The (Visiteurs, Les) (1993)            50.0
845     1594                         Everest (1998)            50.0

In [101]:
#Q2, e (d)

count_rating_womens = count_rating_womens.sort_values(['rating'],ascending=False)
max_count_rating = count_rating_womens.head(1).rating

mean_ratings_women = mean_ratings_women.reset_index()
# count_rating = count_rating.reset_index()


new_rating_movies  = pd.DataFrame(columns = ['movie_id','movie title','new rating'])

for index, row in count_rating_womens.iterrows():
    add_rating =  float((row.rating / max_count_rating))
    new_rating =  mean_ratings_women.loc[mean_ratings_women['movie_id'] == row.movie_id].rating.values[0] + add_rating - 1
    new_rating_movies.loc[index] = [row['movie_id'], row['movie title'], new_rating]

new_rating_movies = new_rating_movies.sort_values(['new rating'],ascending=False)
new_rating_movies.head(3)

     movie_id              movie title  new rating
49         50         Star Wars (1977)    4.312000
314       318  Schindler's List (1993)    4.141161
1121     1150        Last Dance (1996)    4.008000

# Q2, e

# Mens:

In [108]:
#merge movies ratings data with users
movie_ratings_data_and_users = movies_ratings_data.merge(data_u,on = 'user_id',how = 'inner')
men_ratings = movie_ratings_data_and_users[['movie_id','movie title','rating']][movie_ratings_data_and_users.gender == 'M']
men_ratings.head()

   movie_id        movie title  rating
0         1   Toy Story (1995)       5
1         2   GoldenEye (1995)       3
2         3  Four Rooms (1995)       4
3         4  Get Shorty (1995)       3
4         5     Copycat (1995)       3

In [121]:
#Q2, e (a)

mean_ratings_men = men_ratings[['movie_id','movie title','rating']].groupby(['movie_id','movie title']).mean()
mean_ratings_men = mean_ratings_men.sort_values(['rating'],ascending=False)
mean_ratings_men.head(3)

                                    rating
movie_id movie title
1500     Santa with Muscles (1996)     5.0
1189     Prefontaine (1997)            5.0
1656     Little City (1998)            5.0

In [115]:
#Q2, e (b)

count_rating_mens = men_ratings[['movie_id','movie title','rating']].groupby(['movie_id','movie title']).count()
count_rating_mens = count_rating_mens.sort_values(['rating'],ascending=False)
count_rating_mens.head(3)

                                    rating
movie_id movie title
50       Star Wars (1977)              359
181      Return of the Jedi (1983)     318
100      Fargo (1996)                  300

In [117]:
#Q2, e (c)

count_rating_mens = men_ratings[['movie_id','movie title','rating']].groupby(['movie_id','movie title']).count()
count_rating_mens = count_rating_mens.reset_index()

count_rating_big_than_4 = men_ratings[['movie_id','movie title','rating']][men_ratings.rating > 4].groupby(['movie_id','movie title']).count()
count_rating_big_than_4 = count_rating_big_than_4.reset_index()

movies  = pd.DataFrame(columns = ['movie_id','movie title','rating_percent'])

for index, row in count_rating_big_than_4.iterrows():
    total_rating = count_rating.loc[count_rating['movie_id'] == row.movie_id].rating.values[0]
    rating_percent = (float(row.rating) / total_rating) * 100
    movies.loc[index] = [row['movie_id'], row['movie title'],  rating_percent]

movies = movies.sort_values(['rating_percent'],ascending=False)
movies.head(3)

,movie_id,movie title,rating_percent
921,1293,Star Kid (1997),100.0
962,1500,Santa with Muscles (1996),100.0
982,1653,Entertaining Angels: The Dorothy Day Story (1996),100.0

In [118]:
#Q2, e (d)

count_rating_mens = count_rating_mens.sort_values(['rating'],ascending=False)
max_count_rating = count_rating_mens.head(1).rating

mean_ratings_men = mean_ratings_men.reset_index()

new_rating_movies  = pd.DataFrame(columns = ['movie_id','movie title','new rating'])

for index, row in count_rating_mens.iterrows():
    add_rating =  float((row.rating / max_count_rating))
    new_rating =  mean_ratings_men.loc[mean_ratings_men['movie_id'] == row.movie_id].rating.values[0] + add_rating - 1
    new_rating_movies.loc[index] = [row['movie_id'], row['movie title'], new_rating]

new_rating_movies = new_rating_movies.sort_values(['new rating'],ascending=False)
new_rating_movies.head(3)

    movie_id                     movie title  new rating
49        50                Star Wars (1977)    4.376045
126      127           Godfather, The (1972)    4.030356
173      174  Raiders of the Lost Ark (1981)    4.016542

# Q3

In [122]:
m_cols = ['movie_id','movie title','release date','video release date','IMDb URL'
          ,'unknown','Action','Adventure','Animation','Childrens','Comedy',
          'Crime','Documentary','Drama','Fantasy','Film-Noir','Horror','Musical','Mystery','Romance','Sci-Fi',
        'Thriller','War','Western']
data_u_all = pd.read_csv('ml-100k/u.item',delimiter='|',names=m_cols,encoding='latin-1')
data_u_all.head()

,movie_id,movie title,release date,video release date,IMDb URL,unknown,Action,Adventure,Animation,Childrens,...,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,...,0,0,0,0,0,0,0,0,0,0
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,...,0,0,0,0,0,0,0,1,0,0
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995),0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [123]:
from sklearn.metrics import mean_squared_error
from sklearn.decomposition import TruncatedSVD
from sklearn import metrics
from sklearn.ensemble import AdaBoostClassifier
from sklearn.metrics import mean_absolute_error

#Generic function for making a classification model and accessing performance:
def classification_model(model, train,test, predictors, outcome):
    #Fit the model:
    predictions = model.fit(train[predictors],train[outcome]).predict(test[predictors])

    #Print accuracy
    accuracy = metrics.accuracy_score(predictions,test[outcome])
    print("Accuracy : %s" % "{0:.3%}".format(accuracy))

    print "MEA: {}".format(mean_absolute_error(test[outcome], predictions))